# Brewfile
# Run `brew bundle` to install all of these dependencies, or `brew bundle dump --force` to update this file with your current setup.



# Command Line Tools
brew "git"
brew "curl"
brew "wget"
brew "jq"
brew "fzf"
brew "tldr"
brew "tree"
brew "starship"
brew "mas"
brew "fnm"

# Casks (GUI Applications)
cask "visual-studio-code"
cask "iterm2"
cask "ghostty"
cask "font-fira-code-nerd-font"
# cask "docker"
cask "google-chrome"
cask "maccy"
# cask "slack"

# Mac App Store Applications
mas "Magnet", id: 441258766
